package _08_11_2022;

public class FEDescription {
    /**
     * Predicate<T> boolean(T t) - проверяет удовлетворяет ли состояние объекта условию
     * Consumer<T> void(T t) - выполняет действия без возврата результата
     * Function<T, R> R (T t) - принимает в качестве аргумента значение
     * одного типа и возвращает другое значение
     * Supplier<T> T() - возвращает результат без передачи параметра
     * UnaryOperator<T> - T(T t) - принимает в качестве параметра значение одного типа
     * и возвращает значение того же типа
     * BinaryOperator<T> T apply(T t1, T t2) принимает в качестве параметра два объекта типа T, выполняет
     * над ними бинарную операцию и возвращает ее результат также в виде объекта типа T:
     */
}